#ifndef __XMARIADBCONNECT_H__
#define __XMARIADBCONNECT_H__

#include "XCommon.h"
#include <functional>
#include <mysql.h>

class XMariaDBConnect
{
public:
	XMariaDBConnect();
	~XMariaDBConnect();

	void Ping();

	/****************************************************************************************************************
	 *
	 *    Brief   : 查询用户名是否已经存在。
	 *
	 ****************************************************************************************************************/
	int SearchStudentByUserName(const char* pUserName);
	/****************************************************************************************************************
	*
	*    Brief   : 查询学生信息是否存在。
	*
	****************************************************************************************************************/
	int SearchStudentBySchoolAndStudentID(const char* pSchool, const char* pStudentID);
	/****************************************************************************************************************
	*
	*    Brief   : 更新学生信息。
	*
	****************************************************************************************************************/
	int UpdateStudentBySchoolAndStudentID(
		const char* pDevicel, const char* pSchool,
		const char* pMajor, const char* pStudentID,
		const char* pName, const char* pPhoneNumber,
		const char* pUserName, const char* pPassword,
		const char* pDeviceName, const char* pDeviceType);



	/****************************************************************************************************************
	*
	*    Brief   : 查询用户名和密码是否存在。
	*
	****************************************************************************************************************/
	int SearchStudentByUserNameAndPassword(const char* pUserName, const char* pPassword);
	/****************************************************************************************************************
	*
	*    Brief   : 查询推送消息ID
	*
	****************************************************************************************************************/
	int SearchMsgIDByUserName(const char* pUserName, int& msgID);
	/****************************************************************************************************************
	*
	*    Brief   : 查询推送消息
	*
	****************************************************************************************************************/
	int SearchMsg(int& id, char* pMsg);
	/****************************************************************************************************************
	 *
	 *    Brief   : 更新推送消息ID
	 *
	 ****************************************************************************************************************/
	int UpdateMsgIDByUserName(const char* pUserName, int msgID);

	/****************************************************************************************************************
	*
	*    Brief   : 查询用户信息。
	*
	****************************************************************************************************************/
	int SearchInfoByUserName(const char* pUserName, char* pSchool, char* pMajor, char* pStudentID, char* pName, char* pPhoneNumber);



	/****************************************************************************************************************
	 *
	 *    Brief   : 保存反馈信息。
	 *
	 ****************************************************************************************************************/
	int InsertFeedbackByUserName(const char* pUserName, const char* pContent);



	/****************************************************************************************************************
	 *
	 *    Brief   : 更新密码
	 *
	 ****************************************************************************************************************/
	int UpdatePassword(const char* pUserName, const char* pPassword, const char* pNewPassword);


	/****************************************************************************************************************
	 *
	 *    Brief   : 更新手机号
	 *
	 ****************************************************************************************************************/
	int UpdatePhoneNumber(const char* pUserName, const char* pPassword, const char* pNewPhoneNumber);


private:
	void show_error(MYSQL *mysql);
	void Init();
	void Done();

private:
	MYSQL* _pConnect;
};

#endif